> I think the APIGW changes are fine to apply - do you want to do that in `main` so that you can then get a clean plan here? Also you might want to set up terraform fmt as a precommit hook or editor action!

Here we go, much clearer now 
```
Terraform will perform the following actions:

  # data.aws_secretsmanager_secret_version.redirect_action_secret will be read during apply
  # (config refers to values not yet known)
 <= data "aws_secretsmanager_secret_version" "redirect_action_secret" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_binary  = (sensitive value)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

  # auth0_action.redirect_to_full_registration will be created
  + resource "auth0_action" "redirect_to_full_registration" {
      + code       = <<-EOT
            function noop() {
              // Do nothing
            }
        EOT
      + deploy     = true
      + id         = (known after apply)
      + name       = "Redirect to full registration"
      + runtime    = (known after apply)
      + version_id = (known after apply)

      + secrets {
          + name  = "IDENTITY_APP_BASEURL"
          + value = (sensitive value)
        }
      + secrets {
          + name  = "AUTH0_PAYLOAD_SECRET"
          + value = (sensitive value)
        }

      + supported_triggers {
          + id      = "post-login"
          + version = "v2"
        }
    }

  # auth0_trigger_binding.post_login will be updated in-place
  ~ resource "auth0_trigger_binding" "post_login" {
        id      = "post-login"
        # (1 unchanged attribute hidden)

      + actions {
          + display_name = "Redirect to full registration"
          + id           = (known after apply)
        }
        # (1 unchanged block hidden)
    }

  # aws_secretsmanager_secret.redirect_action_secret will be created
  + resource "aws_secretsmanager_secret" "redirect_action_secret" {
      + arn                     = (known after apply)
      + id                      = (known after apply)
      + name                    = "identity/stage/redirect_action_secret"
      + name_prefix             = (known after apply)
      + policy                  = (known after apply)
      + recovery_window_in_days = REDACTED
      + rotation_enabled        = (known after apply)
      + rotation_lambda_arn     = (known after apply)
      + tags_all                = {
          + "Environment"               = "stage"
          + "ManagedBy"                 = "Terraform"
          + "Project"                   = "Identity"
          + "TerraformConfigurationURL" = "https://github.com/wellcomecollection/identity/tree/main/infra/scoped"
        }

      + rotation_rules {
          + automatically_after_days = (known after apply)
        }
    }

Plan: 2 to add, 1 to change, 0 to destroy.

Changes to Outputs:
  ~ auth0_actions = {
      ~ names = {
          + redirect_to_full_registration = "Redirect to full registration"
            # (1 unchanged element hidden)
        }
    }
```